Merge pull request #5 from alimovalisher/feature/refactoring
Refactor and enhance Telegram Bot Core modules and functionality
